# โปรแกรมคำนวณค่า BMI (ดัชนีมวลกาย)
# BMI น้ำหนัก(kg) / ส่วนสูง * ส่วนสูง (m)

'''
หลักการคิดคือ การทำโปรแกรมให้เป็นไปตามสมการ BMI โดยรับข้อมูลน้ำหนัก/ส่ววนสูงมาเก็บไว้ 
จากนั้นใช้เครื่องหมายคำเนินการทางคณิตศาสตร์ +,-,*,/ มาทำเป็นสมการ
'''

# input
# รับค่าน้ำหนักจากคีย์บอร์ด
weight = int(input("กรุณาป้อนน้ำหนักของคุณ (kg) :"))
high = int(input("กรุณาป้อนส่วนสูงของคุณ (cm) :"))  # รับค่าส่วนสูงจากคีย์บอร์ด

# process
# cm => m
high = high/100  # แปลงค่าส่วงสูงจากเซนติเมตรเป็นเมตร
# calculate bmi
BMI = weight/(high*high)  # คำนวณค่า BMI จากสมการ


# output
print("BMI = ", BMI)  # แสดงผลลัพธ์
