# บอกเกณฑ์ BMI

weight = int(input("กรุณาป้อนน้ำหนักของคุณ (kg) :"))
high = int(input("กรุณาป้อนส่วนสูงของคุณ (cm) :"))
high = high/100
BMI = weight/(high*high)

'''
<18 = ต่ำกว่าเกณฑ์
18.5 - 22.9 = สมส่วน
23.0 - 24.9 = นำหนักเกิน
25.0 - 29.9 = โรคอ้วน ระดับ 1
>30 = โรคอ้วน ระดับอันตราย
'''

'''
หลักการคิด คือ การนำเครื่องหมายเปรียบเทียบมาใช้เป็นเงื่อนไข โดยนำค่า BMI ที่ได้จากการคำนวณมาเข้าเงื่อนไขตามที่ระบุไว้
'''

result = "ไม่ทราบค่าชัดเจน"  # สามารถนำไปเป็น else ได้
if BMI >= 10 and BMI < 18.0:
    result = "ต่ำกว่าเกณฑ์"
elif BMI >= 18.5 and BMI <= 22.9:
    result = "สมส่วน"
elif BMI >= 23.0 and BMI <= 24.9:
    result = "น้ำหนักเกิน"
elif BMI >= 25.0 and BMI <= 29.9:
    result = "โรคอ้วน_ระดับ_1"
elif BMI >= 30:
    result = "โรคอ้วน_ระดับอันตราย"
else :
   print(result)
print("ค่า BMI =", BMI)
print("ทำนายว่า =", result)
print("จบโปรแกรม")