#แปลงอุณหภูมิ

'''
หลักการคิด คือ การนำสมการการแปลงหน่อยอุณหภูมิมาเป็นเงื่อนไขในโปรแกรม
โดยได้นำความรู้string ในการแปลงคำ เช่น ทำให้เป็นตัวพิมพ์ใหญ่ การเลือกข้อความในindexห
'''

Temp = input("ป้อนอุณหภูมิ (องศา) :")          #รับค่าอุณหภูมิ และป้อนค่าพร้อมประเภทองศา

degree= int(Temp[:-1])                      #การเอาแค่ค่าตัวเลขอุณหภูมิ ผลลัพธ์จะเป็นตัวเลขอุณหภูมิ
unit = Temp[-1].upper()                     #การเอาแค่ประเภทองศาพร้อมทำให้เป็นตัวพิมพ์ใหญ่ ผลลัพธ์จะเป็น C,F

if unit=="C" :                              #ถ้าตัวแปร(unit) เป็นตัว C
    result=(9*degree)/5+32                  #คำนวณอุณหภูมิเป็นฟาเรนไฮน์
    unit_result="ฟาเรนไฮน์"                  #กำหนดเป็นองศาฟาเรนไฮน์
if unit=="F" :                              #ถ้าตัวแปร(unit) เป็นตัว F
    result=(degree-32)*5/9                  #คำนวณอุณหภูมิเป็นเซลเซียส
    unit_result="เซลเซียส"                   #กำหนดเป็นองศาเซลเซียส

print("แปลงตัวเลข = ",Temp,"เป็น",unit_result,"=",result)
print("จบโปรแกรม")
