#หาผลรวมตัวเลข

'''
หลักการคิดคือ การหาผลรวมของจำนวนรอบและจำนวนผลรวมไปเรื่อยๆ โดยให้หลักการ while loop
โดยโจทย์คือ ให้มีจำนวนรอบคือ 5 รอบ จะได้ผลรวมเท่าไหร่
ให้ทำการตั่งตัวเก็บตัวแปรจำนวนรอบและผลรวมจากนั้นใช้ฟังก์ชั่น while loop ในการเช็คจำนวนรอบไปเรื่อยๆตามที่เรากำหนดไว้ปละนำจำนวนรอบนั้นๆมาบวกกับจำนวนรอบเก่า
ในโจทย์นี้ก้จะได้ 15 เพราะ รอบแรกจำนวนรอบคือ 1 + จำนวนรอบที่แล้ว(ซึ่งมันไม่มี=0) = 1 และนำไปบวกกับจำนวนรอบต่อไป คือ 2 และวนไปเรื่อยๆจนครบ 5 รอบ
'''

i=1 #ตัวนับจำนวนรอบ
summation= 0 #เก็บผลการบวกเลขตามจำนวนรอบ
average = 0 #ผลรวม / จำนวนรอบ
#1+2++3+4+5
count=int(input("ระบุจำนวนรอบ :"))

while i<=count :
    summation+=i #เก็บผลรวมของ i แต่ละรอบ 1 + 2
    print("รอบที่",i,"ค่า sum =", summation)
    i+=1
average=summation/count
print("ผลรวมของการบวกเลข = ", summation)
print("ค่าเฉลี่ย = ", average)
print("จบโปรแกรม")


#ทำเป็นฟังก์ชัน
def summation (number) :
    total=0
    for i in number :
        total+=i
    avg=total/len(number)
    return total , avg

x=[1,2,3]
y,z=summation(x)
print(y)
print(z)