#แสดงแม่สูตรคูณ-โปรแกรมแสดงแม่สูตรคูณ

#แสดงแม่สูตรคูณ  2 , 3 ,4 ,5 ,...
    # 2x1 , 2x2 , 2x3 ,...
#2 , 3

''''
หลักการคิด คือ การใช้การวนลูปมาทำการคูณตามสูตรคูณ โดยสามารป้อนสูตรคูณที่อยากจะหาได้
จะรับค่าจากผู้ใช้มาก่อนจากนั้นนำไปวนลูปเลขนั้น โดยจะซ้อนอีกลูปนึงเพื่อทำการคูณตามแม่สูตรคูณ
'''

for i in range (int(input("จำนวนที่ต้องการใช้ : "))) :
    start=int(input("ป้อนแม่สูตรคูณที่ต้องการ : "))
    stop=start+1
    for x in range (start , stop) :
        print ("แม่ = ",x)
        for y in range (1,13) :
            print(x,'X',y,'=',(x*y))  #x แทนด้วยแม่ 1 - 12  y แทนด้วย1-12 X แทนด้วย *
print("จบโปรแกรม")
