# ค้นหาตัวเลขมากสุด / น้อยสุด

'''
หลักการคิด คือ เราสามารถป้อนเลขไปเท่าไหร่กก็ได้ เเละตัวเลขนั้นจะไปเก็บในค่าตัวแปร max , min ตามที่เราระบุไว้ในตัวดำเนินการทางคณิตศาสตร์
และเมื่อเราใส่ค่าติดลบมันก็จะไปเข้ากับเงื่อนไข if break จะทำให้หยุดจากลูปนี้
'''

max , min = 0,9999

while True :
    number=int(input("ป้อนตัวเลขของคุณ : "))
    if number<0 : 
        break     #กระโดดออกจาก loop
    if number>max :
        max=number
    if number<min :
        min=number

print("ค่าสูงสุด : ",max)
print("ค่าต่ำสุด : ",min)
